Tekla Open API Reference for Tekla Structures 2025
DatabaseObject.SetUserProperty Method
Overload List
Name | Description
SetUserProperty(String, Double)
 Sets a double property for the drawing object. The object has to be in a drawing before the method can be used.
SetUserProperty(String, Int32)
 Sets an integer property for the drawing object. The object has to be in a drawing before the method can be used.
SetUserProperty(String, String)
 Sets a string property for the drawing object. The object has to be in a drawing before the method can be used.
Top
See Also
Reference
DatabaseObject Class
Tekla.Structures.Drawing Namespace